app/controllers/cashiers_controller.rb

SELECT "cashiers".* FROM "cashiers"
---
  def index
    @cashiers = Cashier.all

INSERT INTO "cashiers" ("nome", "categoria", "valor", "data", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["nome", "Almoço"], ["categoria", "Alimentação"], ["valor", "42.0"], ["data", "2018-05-16"], ["created_at", "2018-05-16 15:57:53.600742"], ["updated_at", "2018-05-16 15:57:53.600742"]]
---
  def create
    @cashier = Cashier.new(cashier_params)

    respond_to do |format|
      if @cashier.save

UPDATE "cashiers" SET "valor" = $1, "updated_at" = $2 WHERE "cashiers"."id" = $3  [["valor", "-42.0"], ["updated_at", "2018-05-16 15:58:12.894386"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @cashier.update(cashier_params)

SELECT  "cashiers".* FROM "cashiers" WHERE "cashiers"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_cashier
      @cashier = Cashier.find(params[:id])