app/controllers/eventos_controller.rb

  def index
    @eventos = Evento.all
---
SELECT "eventos".* FROM "eventos"

  def create
    @evento = Evento.new(evento_params)

    respond_to do |format|
      if @evento.save
---
INSERT INTO "eventos" ("evento", "data", "horario", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["evento", "Reunião de Diretoria hj às 16h"], ["data", "2018-05-23"], ["horario", "22:04:00"], ["created_at", "2018-05-23 03:19:50.334405"], ["updated_at", "2018-05-23 03:19:50.334405"]]

    def set_evento
      @evento = Evento.find(params[:id])
---
SELECT  "eventos".* FROM "eventos" WHERE "eventos"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]