app/controllers/project_users_controller.rb

SELECT "project_users".* FROM "project_users"
---
  def index
    @project_users = ProjectUser.all

INSERT INTO "project_users" ("project_id", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["project_id", 4], ["user_id", 2], ["created_at", "2018-05-29 00:50:09.946056"], ["updated_at", "2018-05-29 00:50:09.946056"]]
---
  def create
    @project_user = ProjectUser.new(project_user_params)

    respond_to do |format|
      if @project_user.save

SELECT  "project_users".* FROM "project_users" WHERE "project_users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def set_project_user
      @project_user = ProjectUser.find(params[:id])