app/controllers/projects_controller.rb

SELECT  "sprints".* FROM "sprints" WHERE "sprints"."project_id" = 1 ORDER BY "sprints"."id" ASC LIMIT $1  [["LIMIT", 1]]
SELECT "project_users".* FROM "project_users" WHERE "project_users"."project_id" = 4
---
  def show
    @sprints = Sprint.where(project: @project).all
    @project_users = ProjectUser.where(project: @project).all

INSERT INTO "projects" ("nome", "descricao", "data_inicio", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["nome", ""], ["descricao", ""], ["data_inicio", "2018-05-24"], ["created_at", "2018-05-24 17:03:54.653235"], ["updated_at", "2018-05-24 17:03:54.653235"]]
---
  def create
    @project = Project.new(project_params)

    respond_to do |format|
      if @project.save