app/controllers/sprints_controller.rb

SELECT "sprints".* FROM "sprints"
---
  def index
    @sprints = Sprint.all

INSERT INTO "sprints" ("check", "tarefa", "project_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["check", "f"], ["tarefa", "olhaqtop"], ["project_id", 1], ["created_at", "2018-05-24 16:09:00.671591"], ["updated_at", "2018-05-24 16:09:00.671591"]]
---
  def create
    @sprint = Sprint.new(sprint_params)

    respond_to do |format|
      if @sprint.save

UPDATE "sprints" SET "feito" = $1, "updated_at" = $2 WHERE "sprints"."id" = $3  [["feito", "t"], ["updated_at", "2018-05-23 18:42:54.274905"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @sprint.update(sprint_params)

DELETE FROM "sprints" WHERE "sprints"."id" = $1  [["id", 2]]
---
  def destroy
    @sprint.destroy

SELECT  "sprints".* FROM "sprints" WHERE "sprints"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def set_sprint
      @sprint = Sprint.find(params[:id])