app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("admin", "name", "created_at", "updated_at", "email", "encrypted_password") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "admin" = $1, "encrypted_password" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["admin", "t"], ["encrypted_password", "$2a$11$vxgYonA9ha26OlP0WztaweKjWnTmPazQCWRW7QJ69n0BrmqTq9Bpi"], ["updated_at", "2018-05-23 00:54:30.639452"], ["id", 4]]