app/views/project_users/_form.html.erb

    <%= f.label :user_id %>
    <%= f.collection_select(:user_id, User.all, :id, :name) %>
---
SELECT "users".* FROM "users"